advanced/frontend/models/PasswordResetRequestForm.php

SELECT * FROM `user` WHERE (`status`=10) AND (`email`='wangjiang988@163.com')
UPDATE `user` SET `password_reset_token`='umUVezEkyiMnyBjkYtp844gWU8MQFYO9_1458630100', `updated_at`=1458630100 WHERE `id`=2
---
    public function sendEmail()
    {
        /* @var $user User */
        $user = User::findOne([
            'status' => User::STATUS_ACTIVE,
            'email' => $this->email,
        ]);

        if (!$user) {
            return false;
        }

        if (!User::isPasswordResetTokenValid($user->password_reset_token)) {
            $user->generatePasswordResetToken();
        }

        if (!$user->save()) {